{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "ename": "ModuleNotFoundError",
     "evalue": "No module named 'pandas'",
     "output_type": "error",
     "traceback": [
      "\u001b[1;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[1;31mModuleNotFoundError\u001b[0m                       Traceback (most recent call last)",
      "Cell \u001b[1;32mIn[1], line 11\u001b[0m\n\u001b[0;32m      8\u001b[0m \u001b[38;5;28;01mimport\u001b[39;00m \u001b[38;5;21;01mwarnings\u001b[39;00m\n\u001b[0;32m     10\u001b[0m \u001b[38;5;66;03m# Third-party packages - Data manipulation\u001b[39;00m\n\u001b[1;32m---> 11\u001b[0m \u001b[38;5;28;01mimport\u001b[39;00m \u001b[38;5;21;01mpandas\u001b[39;00m \u001b[38;5;28;01mas\u001b[39;00m \u001b[38;5;21;01mpd\u001b[39;00m\n\u001b[0;32m     12\u001b[0m \u001b[38;5;28;01mfrom\u001b[39;00m \u001b[38;5;21;01mtqdm\u001b[39;00m \u001b[38;5;28;01mimport\u001b[39;00m tqdm\n\u001b[0;32m     14\u001b[0m \u001b[38;5;66;03m# Third-party packages - Environment & Database\u001b[39;00m\n",
      "\u001b[1;31mModuleNotFoundError\u001b[0m: No module named 'pandas'"
     ]
    }
   ],
   "source": [
    "# Type hints\n",
    "from typing import Any, Dict, List, Tuple, Optional\n",
    "\n",
    "# Standard library\n",
    "import ast\n",
    "import logging\n",
    "import re\n",
    "import warnings\n",
    "\n",
    "# Third-party packages - Data manipulation\n",
    "import pandas as pd\n",
    "from tqdm import tqdm\n",
    "\n",
    "# Third-party packages - Environment & Database\n",
    "from dotenv import load_dotenv\n",
    "from neo4j import GraphDatabase\n",
    "\n",
    "# Third-party packages - Error handling & Retry logic\n",
    "from tenacity import retry, stop_after_attempt, wait_exponential\n",
    "\n",
    "# Langchain - Core\n",
    "from langchain.chains import GraphCypherQAChain\n",
    "from langchain.prompts import PromptTemplate\n",
    "from langchain_core.documents import Document\n",
    "\n",
    "# Langchain - Models & Connectors\n",
    "from langchain_google_genai import ChatGoogleGenerativeAI, GoogleGenerativeAI\n",
    "\n",
    "from langchain_ollama.llms import OllamaLLM\n",
    "\n",
    "# Langchain - Graph & Experimental\n",
    "from langchain_community.graphs import Neo4jGraph\n",
    "from langchain_experimental.graph_transformers import LLMGraphTransformer\n",
    "\n",
    "# Suppress warnings\n",
    "warnings.filterwarnings('ignore')\n",
    "\n",
    "# Load environment variables\n",
    "load_dotenv()\n",
    "\n",
    "# api_key = os.getenv(\"GOOGLE_API_KEY\") # if you are using Google API"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Release Year</th>\n",
       "      <th>Title</th>\n",
       "      <th>Origin/Ethnicity</th>\n",
       "      <th>Director</th>\n",
       "      <th>Cast</th>\n",
       "      <th>Genre</th>\n",
       "      <th>Wiki Page</th>\n",
       "      <th>Plot</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1901</td>\n",
       "      <td>Kansas Saloon Smashers</td>\n",
       "      <td>American</td>\n",
       "      <td>Unknown</td>\n",
       "      <td>NaN</td>\n",
       "      <td>unknown</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Kansas_Saloon_Sm...</td>\n",
       "      <td>A bartender is working at a saloon, serving dr...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>1901</td>\n",
       "      <td>Love by the Light of the Moon</td>\n",
       "      <td>American</td>\n",
       "      <td>Unknown</td>\n",
       "      <td>NaN</td>\n",
       "      <td>unknown</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Love_by_the_Ligh...</td>\n",
       "      <td>The moon, painted with a smiling face hangs ov...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>1901</td>\n",
       "      <td>The Martyred Presidents</td>\n",
       "      <td>American</td>\n",
       "      <td>Unknown</td>\n",
       "      <td>NaN</td>\n",
       "      <td>unknown</td>\n",
       "      <td>https://en.wikipedia.org/wiki/The_Martyred_Pre...</td>\n",
       "      <td>The film, just over a minute long, is composed...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>1901</td>\n",
       "      <td>Terrible Teddy, the Grizzly King</td>\n",
       "      <td>American</td>\n",
       "      <td>Unknown</td>\n",
       "      <td>NaN</td>\n",
       "      <td>unknown</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Terrible_Teddy,_...</td>\n",
       "      <td>Lasting just 61 seconds and consisting of two ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>1902</td>\n",
       "      <td>Jack and the Beanstalk</td>\n",
       "      <td>American</td>\n",
       "      <td>George S. Fleming, Edwin S. Porter</td>\n",
       "      <td>NaN</td>\n",
       "      <td>unknown</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Jack_and_the_Bea...</td>\n",
       "      <td>The earliest known adaptation of the classic f...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   Release Year                             Title Origin/Ethnicity  \\\n",
       "0          1901            Kansas Saloon Smashers         American   \n",
       "1          1901     Love by the Light of the Moon         American   \n",
       "2          1901           The Martyred Presidents         American   \n",
       "3          1901  Terrible Teddy, the Grizzly King         American   \n",
       "4          1902            Jack and the Beanstalk         American   \n",
       "\n",
       "                             Director Cast    Genre  \\\n",
       "0                             Unknown  NaN  unknown   \n",
       "1                             Unknown  NaN  unknown   \n",
       "2                             Unknown  NaN  unknown   \n",
       "3                             Unknown  NaN  unknown   \n",
       "4  George S. Fleming, Edwin S. Porter  NaN  unknown   \n",
       "\n",
       "                                           Wiki Page  \\\n",
       "0  https://en.wikipedia.org/wiki/Kansas_Saloon_Sm...   \n",
       "1  https://en.wikipedia.org/wiki/Love_by_the_Ligh...   \n",
       "2  https://en.wikipedia.org/wiki/The_Martyred_Pre...   \n",
       "3  https://en.wikipedia.org/wiki/Terrible_Teddy,_...   \n",
       "4  https://en.wikipedia.org/wiki/Jack_and_the_Bea...   \n",
       "\n",
       "                                                Plot  \n",
       "0  A bartender is working at a saloon, serving dr...  \n",
       "1  The moon, painted with a smiling face hangs ov...  \n",
       "2  The film, just over a minute long, is composed...  \n",
       "3  Lasting just 61 seconds and consisting of two ...  \n",
       "4  The earliest known adaptation of the classic f...  "
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "movies = pd.read_csv('data/wiki_movies.csv')\n",
    "\n",
    "movies.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Release Year</th>\n",
       "      <th>Title</th>\n",
       "      <th>Origin/Ethnicity</th>\n",
       "      <th>Director</th>\n",
       "      <th>Cast</th>\n",
       "      <th>Genre</th>\n",
       "      <th>Plot</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>1907</td>\n",
       "      <td>Daniel boone</td>\n",
       "      <td>American</td>\n",
       "      <td>Wallace mccutcheon and ediwin s. porter</td>\n",
       "      <td>William craven, florence lawrence</td>\n",
       "      <td>Biographical</td>\n",
       "      <td>Boone's daughter befriends an indian maiden as...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>1907</td>\n",
       "      <td>Laughing gas</td>\n",
       "      <td>American</td>\n",
       "      <td>Edwin stanton porter</td>\n",
       "      <td>Bertha regustus, edward boulden</td>\n",
       "      <td>Comedy</td>\n",
       "      <td>The plot is that of a black woman going to the...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>1908</td>\n",
       "      <td>The adventures of dollie</td>\n",
       "      <td>American</td>\n",
       "      <td>D. w. griffith</td>\n",
       "      <td>Arthur v. johnson, linda arvidson</td>\n",
       "      <td>Drama</td>\n",
       "      <td>On a beautiful summer day a father and mother ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>1908</td>\n",
       "      <td>The black viper</td>\n",
       "      <td>American</td>\n",
       "      <td>D. w. griffith</td>\n",
       "      <td>D. w. griffith</td>\n",
       "      <td>Drama</td>\n",
       "      <td>A thug accosts a girl as she leaves her workpl...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>1908</td>\n",
       "      <td>A calamitous elopement</td>\n",
       "      <td>American</td>\n",
       "      <td>D.w. griffith</td>\n",
       "      <td>Harry solter, linda arvidson</td>\n",
       "      <td>Comedy</td>\n",
       "      <td>A young couple decides to elope after being ca...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "    Release Year                     Title Origin/Ethnicity  \\\n",
       "13          1907              Daniel boone         American   \n",
       "15          1907              Laughing gas         American   \n",
       "16          1908  The adventures of dollie         American   \n",
       "17          1908           The black viper         American   \n",
       "18          1908    A calamitous elopement         American   \n",
       "\n",
       "                                   Director  \\\n",
       "13  Wallace mccutcheon and ediwin s. porter   \n",
       "15                     Edwin stanton porter   \n",
       "16                           D. w. griffith   \n",
       "17                           D. w. griffith   \n",
       "18                            D.w. griffith   \n",
       "\n",
       "                                 Cast         Genre  \\\n",
       "13  William craven, florence lawrence  Biographical   \n",
       "15    Bertha regustus, edward boulden        Comedy   \n",
       "16  Arthur v. johnson, linda arvidson         Drama   \n",
       "17                     D. w. griffith         Drama   \n",
       "18       Harry solter, linda arvidson        Comedy   \n",
       "\n",
       "                                                 Plot  \n",
       "13  Boone's daughter befriends an indian maiden as...  \n",
       "15  The plot is that of a black woman going to the...  \n",
       "16  On a beautiful summer day a father and mother ...  \n",
       "17  A thug accosts a girl as she leaves her workpl...  \n",
       "18  A young couple decides to elope after being ca...  "
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "def clean_data(df: pd.DataFrame) -> pd.DataFrame:\n",
    "    \"\"\"Clean and preprocess DataFrame.\n",
    "    \n",
    "    Args:\n",
    "        data: Input DataFrame\n",
    "        \n",
    "    Returns:\n",
    "        Cleaned DataFrame\n",
    "    \"\"\"\n",
    "    df.drop([\"Wiki Page\"], axis=1, inplace=True)\n",
    "\n",
    "    # Drop duplicates\n",
    "    df = df.drop_duplicates(subset='Title', keep='first')\n",
    "    \n",
    "    # Get object columns\n",
    "    col_obj = df.select_dtypes(include=[\"object\"]).columns\n",
    "    \n",
    "    # Clean string columns\n",
    "    for col in col_obj:\n",
    "        # Strip whitespace\n",
    "        df[col] = df[col].str.strip()\n",
    "        \n",
    "        # Replace unknown/empty values\n",
    "        df[col] = df[col].apply(\n",
    "            lambda x: None if pd.isna(x) or x.lower() in [\"\", \"unknown\"] \n",
    "            else x.capitalize()\n",
    "        )\n",
    "    \n",
    "    # Drop rows with any null values\n",
    "    df = df.dropna(how=\"any\", axis=0)\n",
    "    \n",
    "    return df\n",
    "\n",
    "movies = clean_data(movies).head(1000)\n",
    "movies.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Set up Neo4j connection\n",
    "class Neo4jConnection:\n",
    "    def __init__(self, uri, user, password):\n",
    "        self.driver = GraphDatabase.driver(uri, auth=(user, password))\n",
    "\n",
    "    def close(self):\n",
    "        self.driver.close()\n",
    "        print(\"Connection closed\")\n",
    "\n",
    "    def reset_database(self):\n",
    "        with self.driver.session() as session:\n",
    "            session.run(\"MATCH (n) DETACH DELETE n\")\n",
    "        print(\"Database resetted successfully!\")\n",
    "\n",
    "    def add_document(self, documents: list):\n",
    "        self.driver.add_graph_documents(documents)\n",
    "\n",
    "    def execute_query(self, query, parameters=None):\n",
    "        with self.driver.session() as session:\n",
    "            result = session.run(query, parameters or {})\n",
    "            return [record for record in result]\n",
    "\n",
    "# Connect to Neo4j\n",
    "uri = \"bolt://localhost:7687\"\n",
    "user = \"neo4j\"\n",
    "password = \"12345678\"\n",
    "conn = Neo4jConnection(uri, user, password)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Database resetted successfully!\n"
     ]
    }
   ],
   "source": [
    "# just making sure the database is empty\n",
    "conn.reset_database()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Manual Upload"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Loading movies:   0%|          | 0/1000 [00:00<?, ?it/s]"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Loading movies: 100%|██████████| 1000/1000 [00:43<00:00, 23.08it/s]\n"
     ]
    }
   ],
   "source": [
    "def parse_number(value: Any, target_type: type) -> Optional[float]:\n",
    "    \"\"\"Parse string to number with proper error handling.\"\"\"\n",
    "    if pd.isna(value):\n",
    "        return None\n",
    "    try:\n",
    "        cleaned = str(value).strip().replace(',', '')\n",
    "        return target_type(cleaned)\n",
    "    except (ValueError, TypeError):\n",
    "        return None\n",
    "\n",
    "def clean_text(text: str) -> str:\n",
    "    \"\"\"Clean and normalize text fields.\"\"\"\n",
    "    if pd.isna(text):\n",
    "        return \"\"\n",
    "    return str(text).strip().title()\n",
    "\n",
    "def load_movies_to_neo4j(movies_df: pd.DataFrame, connection: GraphDatabase) -> None:\n",
    "    \"\"\"Load movie data into Neo4j with progress tracking and error handling.\"\"\"\n",
    "    \n",
    "    logger = logging.getLogger(__name__)\n",
    "    logger.setLevel(logging.INFO)\n",
    "    \n",
    "    # Query templates\n",
    "    MOVIE_QUERY = \"\"\"\n",
    "        MERGE (movie:Movie {title: $title})\n",
    "        SET movie.year = $year,\n",
    "            movie.origin = $origin,\n",
    "            movie.genre = $genre,\n",
    "            movie.plot = $plot\n",
    "    \"\"\"\n",
    "    \n",
    "    DIRECTOR_QUERY = \"\"\"\n",
    "        MATCH (movie:Movie {title: $title})\n",
    "        MERGE (director:Director {name: $name})\n",
    "        MERGE (director)-[:DIRECTED]->(movie)\n",
    "    \"\"\"\n",
    "    \n",
    "    ACTOR_QUERY = \"\"\"\n",
    "        MATCH (movie:Movie {title: $title})\n",
    "        MERGE (actor:Actor {name: $name})\n",
    "        MERGE (actor)-[:ACTED_IN]->(movie)\n",
    "    \"\"\"\n",
    "\n",
    "    # Process each movie\n",
    "    for _, row in tqdm(movies_df.iterrows(), total=len(movies_df), desc=\"Loading movies\"):\n",
    "        try:\n",
    "            # Prepare movie parameters\n",
    "            movie_params = {\n",
    "                \"title\": clean_text(row[\"Title\"]),\n",
    "                \"year\": parse_number(row[\"Release Year\"], int),\n",
    "                \"origin\": clean_text(row[\"Origin/Ethnicity\"]),\n",
    "                \"genre\": clean_text(row[\"Genre\"]),\n",
    "                \"plot\": str(row[\"Plot\"]).strip()\n",
    "            }\n",
    "            \n",
    "            # Create movie node\n",
    "            connection.execute_query(MOVIE_QUERY, parameters=movie_params)\n",
    "            \n",
    "            # Process directors\n",
    "            for director in str(row[\"Director\"]).split(\" and \"):\n",
    "                director_params = {\n",
    "                    \"name\": clean_text(director),\n",
    "                    \"title\": movie_params[\"title\"]\n",
    "                }\n",
    "                connection.execute_query(DIRECTOR_QUERY, parameters=director_params)\n",
    "            \n",
    "            # Process cast\n",
    "            if pd.notna(row[\"Cast\"]):\n",
    "                for actor in row[\"Cast\"].split(\",\"):\n",
    "                    actor_params = {\n",
    "                        \"name\": clean_text(actor),\n",
    "                        \"title\": movie_params[\"title\"]\n",
    "                    }\n",
    "                    connection.execute_query(ACTOR_QUERY, parameters=actor_params)\n",
    "                    \n",
    "        except Exception as e:\n",
    "            logger.error(f\"Error loading {row['Title']}: {str(e)}\")\n",
    "            continue\n",
    "\n",
    "    logger.info(\"Finished loading movies to Neo4j\")\n",
    "\n",
    "# Load DataFrame to Neo4j\n",
    "load_movies_to_neo4j(movies, conn)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[<Record m.title='The Flying Fleet' a.name='Ramon Navarro'>,\n",
       " <Record m.title='Footlights And Fools' a.name='Raymond Hackett'>,\n",
       " <Record m.title='On Your Back' a.name='Raymond Hackett'>,\n",
       " <Record m.title='Footlights And Fools' a.name='Fredric March'>,\n",
       " <Record m.title='Laughter' a.name='Fredric March'>,\n",
       " <Record m.title='Sarah And Son' a.name='Fredric March'>,\n",
       " <Record m.title='Fox Movietone Follies Of 1929' a.name='Dixie Lee'>,\n",
       " <Record m.title='Glorifying The American Girl' a.name='Dan Healy'>,\n",
       " <Record m.title='Gold Diggers Of Broadway' a.name='Nancy Welford'>,\n",
       " <Record m.title='Half Marriage' a.name='Morgan Farley'>]"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (m:Movie)-[:ACTED_IN]-(a:Actor)\n",
    "RETURN m.title, a.name\n",
    "LIMIT 10;\n",
    "\"\"\"\n",
    "conn.execute_query(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "<img src=\"imgs/manual_graph_.jpeg\" alt=\"Movies plotted on KG\" style=\"width:1000px;\"/>"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Database resetted successfully!\n"
     ]
    }
   ],
   "source": [
    "conn.reset_database()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Release Year: 1907, 1908, 1909...\n",
      "Title: Daniel boone, Laughing gas, The adventures of dollie...\n",
      "Origin/Ethnicity: American...\n",
      "Director: Wallace mccutcheon and ediwin s. porter, Edwin stanton porter, D. w. griffith...\n",
      "Cast: William craven, florence lawrence, Bertha regustus, edward boulden, Arthur v. johnson, linda arvidson...\n",
      "Genre: Biographical, Comedy, Drama...\n",
      "Plot: Boone's daughter befriends an indian maiden as boone and his companion start out on a hunting expedition. while he is away, boone's cabin is attacked by the indians, who set it on fire and abduct boone's daughter. boone returns, swears vengeance, then heads out on the trail to the indian camp. his daughter escapes but is chased. the indians encounter boone, which sets off a huge fight on the edge of a cliff. a burning arrow gets shot into the indian camp. boone gets tied to the stake and tortured. the burning arrow sets the indian camp on fire, causing panic. boone is rescued by his horse, and boone has a knife fight in which he kills the indian chief.[2], The plot is that of a black woman going to the dentist for a toothache and being given laughing gas. on her way walking home, and in other situations, she can't stop laughing, and everyone she meets \"catches\" the laughter from her, including a vendor and police officers., On a beautiful summer day a father and mother take their daughter dollie on an outing to the river. the mother refuses to buy a gypsy's wares. the gypsy tries to rob the mother, but the father drives him off. the gypsy returns to the camp and devises a plan. they return and kidnap dollie while her parents are distracted. a rescue crew is organized, but the gypsy takes dollie to his camp. they gag dollie and hide her in a barrel before the rescue party gets to the camp. once they leave the gypsies and escapes in their wagon. as the wagon crosses the river, the barrel falls into the water. still sealed in the barrel, dollie is swept downstream in dangerous currents. a boy who is fishing in the river finds the barrel, and dollie is reunited safely with her parents....\n"
     ]
    }
   ],
   "source": [
    "# Initialize the LLM\n",
    "# llm = GoogleGenerativeAI(model=\"gemini-1.5-flash\", google_api_key=api_key) # if you are using Google API\n",
    "llm = OllamaLLM(model=\"qwen2.5-coder:latest\")\n",
    "\n",
    "df = movies.copy()\n",
    "\n",
    "# Step 1: Define Node Labels and Properties\n",
    "node_structure = \"\\n\".join(\n",
    "    [f\"{col}: {', '.join(map(str, df[col].unique()[:3]))}...\" for col in df.columns]\n",
    ")\n",
    "\n",
    "print(node_structure)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Setup logging\n",
    "logging.basicConfig(level=logging.INFO)\n",
    "logger = logging.getLogger(__name__)\n",
    "\n",
    "def validate_node_definition(node_def: Dict) -> bool:\n",
    "    \"\"\"Validate node definition structure\"\"\"\n",
    "    if not isinstance(node_def, dict):\n",
    "        return False\n",
    "    return all(\n",
    "        isinstance(v, dict) and all(isinstance(k, str) for k in v.keys())\n",
    "        for v in node_def.values()\n",
    "    )\n",
    "\n",
    "@retry(stop=stop_after_attempt(3), wait=wait_exponential(multiplier=1, min=4, max=10))\n",
    "def get_node_definitions(chain, structure: str, example: Dict) -> Dict[str, Dict[str, str]]:\n",
    "    \"\"\"Get node definitions with retry logic\"\"\"\n",
    "    try:\n",
    "        # Get response from LLM\n",
    "        response = chain.invoke({\"structure\": structure, \"example\": example})\n",
    "        \n",
    "        # Parse response\n",
    "        node_defs = ast.literal_eval(response)\n",
    "        \n",
    "        # Validate structure\n",
    "        if not validate_node_definition(node_defs):\n",
    "            raise ValueError(\"Invalid node definition structure\")\n",
    "            \n",
    "        return node_defs\n",
    "        \n",
    "    except (ValueError, SyntaxError) as e:\n",
    "        logger.error(f\"Error parsing node definitions: {e}\")\n",
    "        raise\n",
    "\n",
    "# Updated node definition template\n",
    "node_example = {\n",
    "    \"NodeLabel1\": {\"property1\": \"row['property1']\", \"property2\": \"row['property2'], ...\"},\n",
    "    \"NodeLabel2\": {\"property1\": \"row['property1']\", \"property2\": \"row['property2'], ...\"},\n",
    "    \"NodeLabel3\": {\"property1\": \"row['property1']\", \"property2\": \"row['property2'], ...\"},\n",
    "}\n",
    "\n",
    "define_nodes_prompt = PromptTemplate(\n",
    "    input_variables=[\"example\", \"structure\"],\n",
    "    template=(\"\"\"\n",
    "        Analyze the dataset structure below and extract the entity labels for nodes and their properties.\\n\n",
    "        The node properties should be based on the dataset columns and their values.\\n\n",
    "        Return the result as a dictionary where the keys are the node labels and the values are the node properties.\\n\\n\n",
    "        Example: {example}\\n\\n\n",
    "        \n",
    "        Dataset Structure:\\n{structure}\\n\\n\n",
    "              \n",
    "        Make sure to include all the possible node labels and their properties.\\n\n",
    "        If a property can be its own node, include it as a separate node label.\\n\n",
    "        Please do not report triple backticks to identify a code block, just return the list of tuples.\\n\n",
    "        Return only the dictionary containing node labels and properties, and don't include any other text or quotation.\n",
    "        \n",
    "        \"\"\"\n",
    "    ),\n",
    ")\n",
    "\n",
    "# Execute with error handling\n",
    "try:\n",
    "    node_chain = define_nodes_prompt | llm\n",
    "\n",
    "    node_definitions = get_node_definitions(node_chain, structure=node_structure, example=node_example)\n",
    "    logger.info(f\"Node Definitions: {node_definitions}\")\n",
    "except Exception as e:\n",
    "    logger.error(f\"Failed to get node definitions: {e}\")\n",
    "    raise"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:__main__:Identified 3 relationships\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Relationships: [('Movie', 'Directed By', 'Director'), ('Movie', 'Includes Cast Member', 'Person'), ('Movie', 'Has Plot', 'Plot')]\n"
     ]
    }
   ],
   "source": [
    "class RelationshipIdentifier:\n",
    "    \"\"\"Identifies relationships between nodes in a graph database.\"\"\"\n",
    "    \n",
    "    RELATIONSHIP_EXAMPLE = [\n",
    "        (\"NodeLabel1\", \"RelationshipLabel\", \"NodeLabel2\"),\n",
    "        (\"NodeLabel1\", \"RelationshipLabel\", \"NodeLabel3\"),\n",
    "        (\"NodeLabel2\", \"RelationshipLabel\", \"NodeLabel3\"),\n",
    "    ]\n",
    "\n",
    "\n",
    "    PROMPT_TEMPLATE = PromptTemplate(\n",
    "    input_variables=[\"structure\", \"node_definitions\", \"example\"],\n",
    "    template=\"\"\"\n",
    "        Consider the following Dataset Structure:\\n{structure}\\n\\n\n",
    "\n",
    "        Consider the following Node Definitions:\\n{node_definitions}\\n\\n\n",
    "\n",
    "        Based on the dataset structure and node definitions, identify relationships (edges) between nodes.\\n\n",
    "        Return the relationships as a list of triples where each triple contains the start node label, relationship label, and end node label, and each triple is a tuple.\\n\n",
    "        Please return only the list of tuples. Please do not report triple backticks to identify a code block, just return the list of tuples.\\n\\n\n",
    "\n",
    "        Example:\\n{example}\n",
    "        \"\"\"\n",
    ")\n",
    "\n",
    "    def __init__(self, llm: Any, logger: logging.Logger = None):\n",
    "        self.llm = llm\n",
    "        self.logger = logger or logging.getLogger(__name__)\n",
    "        self.chain = self.PROMPT_TEMPLATE | self.llm\n",
    "\n",
    "    def validate_relationships(self, relationships: List[Tuple]) -> bool:\n",
    "        \"\"\"Validate relationship structure.\"\"\"\n",
    "        return all(\n",
    "            isinstance(rel, tuple) and \n",
    "            len(rel) == 3 and \n",
    "            all(isinstance(x, str) for x in rel)\n",
    "            for rel in relationships\n",
    "        )\n",
    "\n",
    "    @retry(stop=stop_after_attempt(3), wait=wait_exponential(multiplier=1, min=4, max=10))\n",
    "    def identify_relationships(self, structure: str, node_definitions: Dict) -> List[Tuple]:\n",
    "        \"\"\"Identify relationships with retry logic.\"\"\"\n",
    "        try:\n",
    "            # response = self.chain.run(\n",
    "            #     structure=structure,\n",
    "            #     node_definitions=str(node_definitions),\n",
    "            #     example=str(self.RELATIONSHIP_EXAMPLE)\n",
    "            # )\n",
    "            response = self.chain.invoke({\n",
    "                \"structure\": structure, \n",
    "                \"node_definitions\": str(node_definitions), \n",
    "                \"example\": str(self.RELATIONSHIP_EXAMPLE)\n",
    "            })\n",
    "            \n",
    "            relationships = ast.literal_eval(response)\n",
    "            \n",
    "            if not self.validate_relationships(relationships):\n",
    "                raise ValueError(\"Invalid relationship structure\")\n",
    "                \n",
    "            self.logger.info(f\"Identified {len(relationships)} relationships\")\n",
    "            return relationships\n",
    "            \n",
    "        except Exception as e:\n",
    "            self.logger.error(f\"Error identifying relationships: {e}\")\n",
    "            raise\n",
    "\n",
    "    def get_relationship_types(self) -> List[str]:\n",
    "        \"\"\"Extract unique relationship types.\"\"\"\n",
    "        return list(set(rel[1] for rel in self.identify_relationships()))\n",
    "\n",
    "# Usage\n",
    "identifier = RelationshipIdentifier(llm=llm)\n",
    "relationships = identifier.identify_relationships(node_structure, node_definitions)\n",
    "print(\"Relationships:\", relationships)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "class CypherQueryBuilder:\n",
    "    \"\"\"Builds Cypher queries for Neo4j graph database.\"\"\"\n",
    "\n",
    "    INPUT_EXAMPLE = \"\"\"\n",
    "    NodeLabel1: value1, value2\n",
    "    NodeLabel2: value1, value2\n",
    "    \"\"\"\n",
    "    \n",
    "    EXAMPLE_CYPHER = example_cypher = \"\"\"\n",
    "    CREATE (n1:NodeLabel1 {property1: \"row['property1']\", property2: \"row['property2']\"})\n",
    "    CREATE (n2:NodeLabel2 {property1: \"row['property1']\", property2: \"row['property2']\"})\n",
    "    CREATE (n1)-[:RelationshipLabel]->(n2);\n",
    "    \"\"\"\n",
    "\n",
    "    PROMPT_TEMPLATE = PromptTemplate(\n",
    "    input_variables=[\"structure\", \"node_definitions\", \"relationships\", \"example\"],\n",
    "    template=\"\"\"\n",
    "        Consider the following Node Definitions:\\n{node_definitions}\\n\\n\n",
    "        Consider the following Relationships:\\n{relationships}\\n\\n\n",
    "        Generate Cypher queries to create nodes and relationships using the node definitions and relationships below. Remember to replace the placeholder values with actual data from the dataset.\\n\n",
    "        Include all the properties in the Node Definitions for each node as defined and create relationships.\\n\n",
    "        Return a single string with each query separated by a semicolon.\\n\n",
    "        Don't include any other text or quotation marks in the response.\\n\n",
    "        Please return only the string containing Cypher queries. Please do not report triple backticks to identify a code block.\\n\\n\n",
    "\n",
    "        Example Input:\\n{input}\\n\\n\n",
    "\n",
    "        Example Output Cypher query:\\n{cypher}\n",
    "    \"\"\"\n",
    ")\n",
    "\n",
    "    def __init__(self, llm: Any, logger: logging.Logger = None):\n",
    "        self.llm = llm\n",
    "        self.logger = logger or logging.getLogger(__name__)\n",
    "        # self.chain = LLMChain(llm=llm, prompt=self.PROMPT_TEMPLATE)\n",
    "        self.chain = self.PROMPT_TEMPLATE | self.llm\n",
    "\n",
    "    def validate_cypher_query(self, query: str) -> bool:\n",
    "        \"\"\"Validate Cypher query syntax using LLM and regex patterns.\"\"\"\n",
    "        \n",
    "        VALIDATION_PROMPT = PromptTemplate(\n",
    "            input_variables=[\"query\"],\n",
    "            template=\"\"\"\n",
    "            Validate this Cypher query and return TRUE or FALSE:\n",
    "            \n",
    "            Query: {query}\n",
    "            \n",
    "            Rules to check:\n",
    "            1. Valid CREATE statements\n",
    "            2. Proper property formatting\n",
    "            3. Valid relationship syntax\n",
    "            4. No missing parentheses\n",
    "            5. Valid property names\n",
    "            6. Valid relationship types\n",
    "            \n",
    "            Return only TRUE if query is valid, FALSE if invalid.\n",
    "            \"\"\"\n",
    "        )\n",
    "        \n",
    "        try:\n",
    "            # Basic pattern validation\n",
    "            basic_valid = all(re.search(pattern, query) for pattern in [\n",
    "                r'CREATE \\(',  \n",
    "                r'\\{.*?\\}',    \n",
    "                r'\\)-\\[:.*?\\]->'\n",
    "            ])\n",
    "            \n",
    "            if not basic_valid:\n",
    "                return False\n",
    "                \n",
    "            # LLM validation\n",
    "            validation_chain = VALIDATION_PROMPT | self.llm\n",
    "            result = validation_chain.invoke({\"query\": query})\n",
    "            \n",
    "            # Parse result\n",
    "            is_valid = \"TRUE\" in result.upper()\n",
    "            \n",
    "            if not is_valid:\n",
    "                self.logger.warning(f\"LLM validation failed for query: {query}\")\n",
    "                \n",
    "            return is_valid\n",
    "            \n",
    "        except Exception as e:\n",
    "            self.logger.error(f\"Validation error: {e}\")\n",
    "            return False\n",
    "\n",
    "    def sanitize_query(self, query: str) -> str:\n",
    "        \"\"\"Sanitize and format Cypher query.\"\"\"\n",
    "        return (query\n",
    "                .strip()\n",
    "                .replace('\\n', ' ')\n",
    "                .replace('  ', ' ')\n",
    "                .replace(\"'row[\", \"row['\")\n",
    "                .replace(\"]'\", \"']\"))\n",
    "\n",
    "    @retry(stop=stop_after_attempt(3), wait=wait_exponential(multiplier=1, min=4, max=10))\n",
    "    def build_queries(self, node_definitions: Dict, relationships: List) -> str:\n",
    "        \"\"\"Build Cypher queries with retry logic.\"\"\"\n",
    "        try:\n",
    "            response = self.chain.invoke({\n",
    "                \"node_definitions\": str(node_definitions),\n",
    "                \"relationships\": str(relationships),\n",
    "                \"input\": self.INPUT_EXAMPLE,\n",
    "                \"cypher\": self.EXAMPLE_CYPHER\n",
    "            })\n",
    "\n",
    "            # Get response inside triple backticks\n",
    "            if '```' in response:\n",
    "                response = response.split('```')[1]\n",
    "\n",
    "            \n",
    "            # Sanitize response\n",
    "            queries = self.sanitize_query(response)\n",
    "            \n",
    "            # Validate queries\n",
    "            if not self.validate_cypher_query(queries):\n",
    "                raise ValueError(\"Invalid Cypher query syntax\")\n",
    "                \n",
    "            self.logger.info(\"Successfully generated Cypher queries\")\n",
    "            return queries\n",
    "            \n",
    "        except Exception as e:\n",
    "            self.logger.error(f\"Error building Cypher queries: {e}\")\n",
    "            raise\n",
    "\n",
    "    def split_queries(self, queries: str) -> List[str]:\n",
    "        \"\"\"Split combined queries into individual statements.\"\"\"\n",
    "        return [q.strip() for q in queries.split(';') if q.strip()]\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "WARNING:__main__:LLM validation failed for query: CREATE (m:Movie {Release Year: \"row['Release Year']\", Title: \"row['Title']\", Genre: \"row['Genre']\"}); CREATE (d:Director {Name: \"row['Director']\", Role: 'Directs'}); CREATE (p:Plot {Summary: \"row['Plot']\"}); CREATE (m)-[:Directed_By]->(d); CREATE (m)-[:Includes_Cast_Member]->(p);\n",
      "ERROR:__main__:Error building Cypher queries: Invalid Cypher query syntax\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "WARNING:__main__:LLM validation failed for query: CREATE (m:Movie {Release Year: \"row['Release Year']\", Title: \"row['Title']\", Genre: \"row['Genre']\"}); CREATE (p:Person {Name: \"row['Cast']\", Role: 'Not specified in dataset'}); CREATE (d:Director {Name: \"row['Director']\", Role: 'Directs'}); CREATE (pr:Plot {Summary: \"row['Plot']\"}); CREATE (m)-[:Directed_By]->(d); CREATE (m)-[:Includes_Cast_Member]->(p); CREATE (m)-[:Has_Plot]->(pr);\n",
      "ERROR:__main__:Error building Cypher queries: Invalid Cypher query syntax\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:__main__:Successfully generated Cypher queries\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Cypher Queries: CREATE (m:Movie {Release Year: \"row['Release Year']\", Title: \"row['Title']\", Genre: \"row['Genre']\"}) CREATE (p:Person {Name: \"row['Cast']\", Role: 'Not specified in dataset'}) CREATE (d:Director {Name: \"row['Director']\", Role: 'Directs'}) CREATE (plot:Plot {Summary: \"row['Plot']\"}) CREATE (m)-[:Directed_By]->(d) CREATE (m)-[:Includes_Cast_Member]->(p) CREATE (m)-[:Has_Plot]->(plot);\n"
     ]
    }
   ],
   "source": [
    "# Usage\n",
    "builder = CypherQueryBuilder(llm=llm)\n",
    "cypher_queries = builder.build_queries(node_definitions, relationships)\n",
    "print(\"Cypher Queries:\", cypher_queries)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Loading data to Neo4j: 100%|██████████| 1000/1000 [00:03<00:00, 250.74it/s]\n"
     ]
    }
   ],
   "source": [
    "# Iterate over dataframe with progress bar\n",
    "logs = \"\"\n",
    "total_rows = len(df)\n",
    "\n",
    "def sanitize_value(value):\n",
    "    if isinstance(value, str):\n",
    "        return value.replace('\"', '')\n",
    "    return str(value)\n",
    "\n",
    "for index, row in tqdm(df.iterrows(), \n",
    "                      total=total_rows,\n",
    "                      desc=\"Loading data to Neo4j\",\n",
    "                      position=0,\n",
    "                      leave=True):\n",
    "    \n",
    "    # Replace placeholders with actual values\n",
    "    cypher_query = cypher_queries\n",
    "    for column in df.columns:\n",
    "        cypher_query = cypher_query.replace(\n",
    "            f\"row['{column}']\", \n",
    "            f'{sanitize_value(row[column])}'\n",
    "        )\n",
    "    \n",
    "    try:\n",
    "        # Execute query and update progress\n",
    "        conn.execute_query(cypher_query)\n",
    "    except Exception as e:\n",
    "        logs += f\"Error on row {index+1}: {str(e)}\\n\"\n",
    "\n",
    "# Display logs\n",
    "# print(logs) # Uncomment to display logs"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 76,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH p=(m:Movie)-[r]-(n)\n",
    "RETURN p\n",
    "LIMIT 5;\n",
    "\"\"\"\n",
    "conn.execute_query(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "![custom_graph_builder.jpeg](imgs/custom_graph_builder.jpeg)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Database resetted successfully!\n"
     ]
    }
   ],
   "source": [
    "conn.reset_database()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Release Year</th>\n",
       "      <th>Title</th>\n",
       "      <th>Origin/Ethnicity</th>\n",
       "      <th>Director</th>\n",
       "      <th>Cast</th>\n",
       "      <th>Genre</th>\n",
       "      <th>Plot</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>1907</td>\n",
       "      <td>Daniel boone</td>\n",
       "      <td>American</td>\n",
       "      <td>Wallace mccutcheon and ediwin s. porter</td>\n",
       "      <td>William craven, florence lawrence</td>\n",
       "      <td>Biographical</td>\n",
       "      <td>Boone's daughter befriends an indian maiden as...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>1907</td>\n",
       "      <td>Laughing gas</td>\n",
       "      <td>American</td>\n",
       "      <td>Edwin stanton porter</td>\n",
       "      <td>Bertha regustus, edward boulden</td>\n",
       "      <td>Comedy</td>\n",
       "      <td>The plot is that of a black woman going to the...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>1908</td>\n",
       "      <td>The adventures of dollie</td>\n",
       "      <td>American</td>\n",
       "      <td>D. w. griffith</td>\n",
       "      <td>Arthur v. johnson, linda arvidson</td>\n",
       "      <td>Drama</td>\n",
       "      <td>On a beautiful summer day a father and mother ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>1908</td>\n",
       "      <td>The black viper</td>\n",
       "      <td>American</td>\n",
       "      <td>D. w. griffith</td>\n",
       "      <td>D. w. griffith</td>\n",
       "      <td>Drama</td>\n",
       "      <td>A thug accosts a girl as she leaves her workpl...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>1908</td>\n",
       "      <td>A calamitous elopement</td>\n",
       "      <td>American</td>\n",
       "      <td>D.w. griffith</td>\n",
       "      <td>Harry solter, linda arvidson</td>\n",
       "      <td>Comedy</td>\n",
       "      <td>A young couple decides to elope after being ca...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "    Release Year                     Title Origin/Ethnicity  \\\n",
       "13          1907              Daniel boone         American   \n",
       "15          1907              Laughing gas         American   \n",
       "16          1908  The adventures of dollie         American   \n",
       "17          1908           The black viper         American   \n",
       "18          1908    A calamitous elopement         American   \n",
       "\n",
       "                                   Director  \\\n",
       "13  Wallace mccutcheon and ediwin s. porter   \n",
       "15                     Edwin stanton porter   \n",
       "16                           D. w. griffith   \n",
       "17                           D. w. griffith   \n",
       "18                            D.w. griffith   \n",
       "\n",
       "                                 Cast         Genre  \\\n",
       "13  William craven, florence lawrence  Biographical   \n",
       "15    Bertha regustus, edward boulden        Comedy   \n",
       "16  Arthur v. johnson, linda arvidson         Drama   \n",
       "17                     D. w. griffith         Drama   \n",
       "18       Harry solter, linda arvidson        Comedy   \n",
       "\n",
       "                                                 Plot  \n",
       "13  Boone's daughter befriends an indian maiden as...  \n",
       "15  The plot is that of a black woman going to the...  \n",
       "16  On a beautiful summer day a father and mother ...  \n",
       "17  A thug accosts a girl as she leaves her workpl...  \n",
       "18  A young couple decides to elope after being ca...  "
      ]
     },
     "execution_count": 78,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "movies.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Release Year: 1916\n",
      "Title: One a.m.\n",
      "Origin/Ethnicity: American\n",
      "Director: Charlie chaplin\n",
      "Cast: Charlie chaplin\n",
      "Genre: Short comedy\n",
      "Plot: The film opens with a scene of a wealthy young man (chaplin) arriving at his house in a taxi late at night after a night of heavy drinking. he struggles with the car door when exiting the car and then in paying the taxi driver (albert austin). when he gets to his front door, he thinks that he has forgotten the key and has to enter through the window. while climbing in through the window, he steps into a fishbowl that's placed underneath it and then almost falls down when the carpet underneath him slides. after finding his balance again, he goes through his pockets and realises that the key has been there all the while. he goes back through the window and enters through the front door.\n",
      "inside the house, the furniture and other inanimate objects become almost insurmountable obstacles for the drunk. he struggles to balance on the sliding carpets and wonders whether he is wearing skates. falling down, he lands between a tiger rug and a stuffed eurasian lynx, which terrify him as he thinks they are real. he goes over to the table and tries to pour himself a drink, but first he accidentally spins the table top around and then does not manage to pour the drinks inside a glass. he then unsuccessfully attempts to light a cigarette, and then tries to head up the stairs to his bedroom. he fails several times in climbing them; a large cuckoo clock on the upstairs landing also poses a problem. he becomes increasingly creative with his attempts to climb the stairs, for example by using mountain climbing gear.\n",
      "when he finally reaches his bedroom, he struggles to open his murphy bed and ends up wrecking it. he gives up on the idea of sleeping in his bed and goes to bathroom. he enters the shower and accidentally turns it on. soaked, he then gets into the bathtub and falls asleep under a towel.\n",
      "\n"
     ]
    }
   ],
   "source": [
    "\n",
    "print(text)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Creating documents: 100%|██████████| 100/100 [00:00<00:00, 11262.90it/s]\n"
     ]
    }
   ],
   "source": [
    "llm_transformer = LLMGraphTransformer(\n",
    "    llm=llm,\n",
    ")\n",
    "\n",
    "df_sample = df.head(100) # Reduce sample size for faster processing\n",
    "\n",
    "documents = []\n",
    "for _, row in tqdm(df_sample.iterrows(), \n",
    "                   total=len(df_sample), \n",
    "                   desc=\"Creating documents\",\n",
    "                   position=0, \n",
    "                   leave=True):\n",
    "    try:\n",
    "        # Format text with proper line breaks\n",
    "        text = \"\"\n",
    "\n",
    "        for col in df.columns:\n",
    "            text += f\"{col}: {row[col]}\\n\"\n",
    "        \n",
    "        documents.append(Document(page_content=text))\n",
    "        \n",
    "    except KeyError as e:\n",
    "        tqdm.write(f\"Missing column: {e}\")\n",
    "    except Exception as e:\n",
    "        tqdm.write(f\"Error processing row: {e}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "INFO:httpx:HTTP Request: POST http://127.0.0.1:11434/api/generate \"HTTP/1.1 200 OK\"\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Nodes:[Node(id='Daniel Boone', type='Movie', properties={}), Node(id='Biographical', type='Genre', properties={}), Node(id='Edwin S. Porter', type='Person', properties={}), Node(id='American', type='Ethnicity', properties={}), Node(id='Daniel Boone', type='Person', properties={}), Node(id='Wallace mccutcheon', type='Person', properties={})]\n",
      "Relationships:[Relationship(source=Node(id='Daniel Boone', type='Person', properties={}), target=Node(id='American', type='Ethnicity', properties={}), type='ORIGIN/EthNICITY', properties={}), Relationship(source=Node(id='Daniel Boone', type='Person', properties={}), target=Node(id='Biographical', type='Genre', properties={}), type='GENRE', properties={}), Relationship(source=Node(id='Wallace mccutcheon', type='Person', properties={}), target=Node(id='Daniel Boone', type='Movie', properties={}), type='DIRECTOR', properties={}), Relationship(source=Node(id='Edwin S. Porter', type='Person', properties={}), target=Node(id='Daniel Boone', type='Movie', properties={}), type='DIRECTOR', properties={})]\n"
     ]
    }
   ],
   "source": [
    "graph_documents = await llm_transformer.aconvert_to_graph_documents(documents)\n",
    "print(f\"Nodes:{graph_documents[0].nodes}\")\n",
    "print(f\"Relationships:{graph_documents[0].relationships}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [
    {
     "ename": "NameError",
     "evalue": "name 'Neo4jGraph' is not defined",
     "output_type": "error",
     "traceback": [
      "\u001b[1;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[1;31mNameError\u001b[0m                                 Traceback (most recent call last)",
      "Cell \u001b[1;32mIn[2], line 1\u001b[0m\n\u001b[1;32m----> 1\u001b[0m graph \u001b[38;5;241m=\u001b[39m \u001b[43mNeo4jGraph\u001b[49m(url\u001b[38;5;241m=\u001b[39muri, username\u001b[38;5;241m=\u001b[39muser, password\u001b[38;5;241m=\u001b[39mpassword, enhanced_schema\u001b[38;5;241m=\u001b[39m\u001b[38;5;28;01mTrue\u001b[39;00m)\n\u001b[0;32m      2\u001b[0m graph\u001b[38;5;241m.\u001b[39madd_graph_documents(graph_documents)\n",
      "\u001b[1;31mNameError\u001b[0m: name 'Neo4jGraph' is not defined"
     ]
    }
   ],
   "source": [
    "graph = Neo4jGraph(url=uri, username=user, password=password, enhanced_schema=True)\n",
    "graph.add_graph_documents(graph_documents)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Cypher Query:\n",
    "```Cypher\n",
    "MATCH p=(m:Movie)-[r]-(n)\n",
    "RETURN p;\n",
    "```\n",
    "\n",
    "![llm_graph_transformer.jpeg](imgs/llm_graph_transformer.jpeg)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [
    {
     "ename": "NameError",
     "evalue": "name 'graph' is not defined",
     "output_type": "error",
     "traceback": [
      "\u001b[1;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[1;31mNameError\u001b[0m                                 Traceback (most recent call last)",
      "Cell \u001b[1;32mIn[1], line 1\u001b[0m\n\u001b[1;32m----> 1\u001b[0m \u001b[43mgraph\u001b[49m\u001b[38;5;241m.\u001b[39mrefresh_schema()\n\u001b[0;32m      3\u001b[0m \u001b[38;5;66;03m# llm_chat = ChatGoogleGenerativeAI(\u001b[39;00m\n\u001b[0;32m      4\u001b[0m \u001b[38;5;66;03m#     model=\"gemini-1.5-pro\",\u001b[39;00m\n\u001b[0;32m      5\u001b[0m \u001b[38;5;66;03m#     temperature=0,\u001b[39;00m\n\u001b[1;32m   (...)\u001b[0m\n\u001b[0;32m      9\u001b[0m \u001b[38;5;66;03m#     api_key=api_key\u001b[39;00m\n\u001b[0;32m     10\u001b[0m \u001b[38;5;66;03m# )\u001b[39;00m\n\u001b[0;32m     12\u001b[0m CYPHER_GENERATION_TEMPLATE \u001b[38;5;241m=\u001b[39m \u001b[38;5;124m\"\"\"\u001b[39m\u001b[38;5;124mTask:Generate Cypher statement to query a graph database.\u001b[39m\n\u001b[0;32m     13\u001b[0m \u001b[38;5;124mInstructions:\u001b[39m\n\u001b[0;32m     14\u001b[0m \u001b[38;5;124mUse only the provided relationship types and properties in the schema.\u001b[39m\n\u001b[1;32m   (...)\u001b[0m\n\u001b[0;32m     30\u001b[0m \u001b[38;5;124mThe question is:\u001b[39m\n\u001b[0;32m     31\u001b[0m \u001b[38;5;132;01m{question}\u001b[39;00m\u001b[38;5;124m\"\"\"\u001b[39m\n",
      "\u001b[1;31mNameError\u001b[0m: name 'graph' is not defined"
     ]
    }
   ],
   "source": [
    "graph.refresh_schema()\n",
    "\n",
    "# llm_chat = ChatGoogleGenerativeAI(\n",
    "#     model=\"gemini-1.5-pro\",\n",
    "#     temperature=0,\n",
    "#     max_tokens=None,\n",
    "#     timeout=None,\n",
    "#     max_retries=2,\n",
    "#     api_key=api_key\n",
    "# )\n",
    "\n",
    "CYPHER_GENERATION_TEMPLATE = \"\"\"Task:Generate Cypher statement to query a graph database.\n",
    "Instructions:\n",
    "Use only the provided relationship types and properties in the schema.\n",
    "Do not use any other relationship types or properties that are not provided.\n",
    "Schema:\n",
    "{schema}\n",
    "Note: Do not include any explanations or apologies in your responses.\n",
    "Do not respond to any questions that might ask anything else than for you to construct a Cypher statement.\n",
    "Do not include any text except the generated Cypher statement.\n",
    "Identify the main node, and return all the relationships and nodes connected to it.\n",
    "If no properties are provided, assume the nodes have only a property id.\n",
    "Please don't filter on relationships or connected nodes.\n",
    "\n",
    "Format the query as follows:\n",
    "MATCH p=(n:NodeLabel)-[r]-(m)\n",
    "WHERE n.id = 'value1'\n",
    "RETURN p\n",
    "\n",
    "The question is:\n",
    "{question}\"\"\"\n",
    "\n",
    "CYPHER_GENERATION_PROMPT = PromptTemplate(\n",
    "    input_variables=[\"schema\", \"question\"], template=CYPHER_GENERATION_TEMPLATE\n",
    ")\n",
    "\n",
    "chain = GraphCypherQAChain.from_llm(\n",
    "    llm, \n",
    "    graph=graph, \n",
    "    verbose=True, \n",
    "    allow_dangerous_requests=True, \n",
    "    return_intermediate_steps=True,\n",
    "    cypher_prompt=CYPHER_GENERATION_PROMPT\n",
    ")\n",
    "\n",
    "chain.run(\"Give me year public of the movie titled David Copperfield.\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "['query']\n"
     ]
    }
   ],
   "source": [
    "print(chain.input_keys)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Database resetted successfully!\n"
     ]
    }
   ],
   "source": [
    "conn.reset_database()\n",
    "conn.close()"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python (PyTorch)",
   "language": "python",
   "name": "pytorch_env"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.16"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
